In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":["Shraddha", "Kajal", "Skilllf", "Pandas"],
    "marks":[99,92,91,90],
    "city":["Varanasi","Maharastra","Antartica","KIET"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

       name  marks        city
0  Shraddha     99    Varanasi
1     Kajal     92  Maharastra
2   Skilllf     91   Antartica
3    Pandas     90        KIET

In [5]:
df.to_csv("friends.csv")

In [6]:
df.to_csv("friends_index.csv", index=False)

In [7]:
df.head(2)

       name  marks        city
0  Shraddha     99    Varanasi
1     Kajal     92  Maharastra

In [8]:
df.tail(2)

      name  marks       city
2  Skilllf     91  Antartica
3   Pandas     90       KIET

In [9]:
df.describe()

           marks
count   4.000000
mean   93.000000
std     4.082483
min    90.000000
25%    90.750000
50%    91.500000
75%    93.750000
max    99.000000

In [10]:
shraddha = pd.read_csv("shraddha.csv")

In [11]:
shraddha

       name  marks        city
0  Shraddha     99    Varanasi
1     Kajal     92  Maharastra
2   Skilllf     91   Antartica
3    Pandas     90        KIET

In [12]:
shraddha["marks"]

0    99
1    92
2    91
3    90
Name: marks, dtype: int64

In [13]:
shraddha["marks"][0]

np.int64(99)

In [14]:
shraddha["marks"][0] = 100

C:\Users\Shraddha\AppData\Local\Temp\ipykernel_5948\1462965996.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  shraddha["marks"][0] = 100

In [15]:
shraddha

       name  marks        city
0  Shraddha    100    Varanasi
1     Kajal     92  Maharastra
2   Skilllf     91   Antartica
3    Pandas     90        KIET

In [16]:
shraddha.index = ["first","second","third","fourth"]

In [17]:
shraddha

            name  marks        city
first   Shraddha    100    Varanasi
second     Kajal     92  Maharastra
third    Skilllf     91   Antartica
fourth    Pandas     90        KIET

In [19]:
ser = pd.Series(np.random.rand(30))

In [20]:
ser

0     0.376250
1     0.086926
2     0.291600
3     0.856810
4     0.565789
5     0.663673
6     0.945783
7     0.827879
8     0.788518
9     0.365168
10    0.913477
11    0.900011
12    0.378361
13    0.795402
14    0.972798
15    0.506629
16    0.219284
17    0.791740
18    0.333151
19    0.821784
20    0.806375
21    0.321813
22    0.577285
23    0.905744
24    0.379255
25    0.205466
26    0.201879
27    0.577298
28    0.120652
29    0.135690
dtype: float64

In [21]:
type(ser)

pandas.core.series.Series

In [22]:
df2 = pd.DataFrame(np.random.rand(10,5), index = np.arange(10))

In [23]:
df2

          0         1         2         3         4
0  0.549708  0.829013  0.498390  0.029532  0.762452
1  0.888598  0.905147  0.569863  0.092270  0.476578
2  0.802629  0.718475  0.990198  0.654161  0.529322
3  0.752744  0.623880  0.116107  0.078873  0.849755
4  0.400134  0.523398  0.179392  0.080519  0.535037
5  0.339291  0.791230  0.739855  0.382769  0.213733
6  0.130444  0.123177  0.797620  0.365228  0.174167
7  0.645507  0.783332  0.354156  0.614220  0.475399
8  0.124067  0.408000  0.500950  0.351066  0.040630
9  0.438002  0.899256  0.378326  0.227333  0.245678

In [24]:
type(df2)

pandas.core.frame.DataFrame

In [25]:
df2.describe()

               0          1          2          3          4
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean    0.507113   0.660491   0.512486   0.287597   0.430275
std     0.268153   0.247970   0.274057   0.224844   0.260267
min     0.124067   0.123177   0.116107   0.029532   0.040630
25%     0.354502   0.548519   0.360198   0.083456   0.221719
50%     0.493855   0.750904   0.499670   0.289199   0.475988
75%     0.725935   0.819567   0.697357   0.378384   0.533608
max     0.888598   0.905147   0.990198   0.654161   0.849755

In [26]:
df2.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
df2.head()

          0         1         2         3         4
0  0.549708  0.829013  0.498390  0.029532  0.762452
1  0.888598  0.905147  0.569863  0.092270  0.476578
2  0.802629  0.718475  0.990198  0.654161  0.529322
3  0.752744  0.623880  0.116107  0.078873  0.849755
4  0.400134  0.523398  0.179392  0.080519  0.535037

In [28]:
df2[0][0] = "Shraddha"

C:\Users\Shraddha\AppData\Local\Temp\ipykernel_5948\291398570.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df2[0][0] = "Shraddha"
C:\Users\Shraddha\AppData\Local\Temp\ipykernel_5948\291398570.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Shraddha' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df2[0][0] = "Shraddha"

In [29]:
df2.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
df2.head()

          0         1         2         3         4
0  Shraddha  0.829013  0.498390  0.029532  0.762452
1  0.888598  0.905147  0.569863  0.092270  0.476578
2  0.802629  0.718475  0.990198  0.654161  0.529322
3  0.752744  0.623880  0.116107  0.078873  0.849755
4  0.400134  0.523398  0.179392  0.080519  0.535037

In [31]:
df2.index

Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [32]:
df2.columns

RangeIndex(start=0, stop=5, step=1)

In [34]:
df2.to_numpy()

array([['Shraddha', 0.8290128022559419, 0.4983897280663214,
        0.029531974722376675, 0.7624519405793065],
       [0.8885984928488976, 0.9051470943706853, 0.5698625629054966,
        0.09226958656017825, 0.4765779312537395],
       [0.8026290675795894, 0.7184752862761291, 0.9901978791720225,
        0.6541609342867823, 0.5293218346928674],
       [0.7527443791471864, 0.6238804540956805, 0.11610704900391644,
        0.07887284666351024, 0.8497553954586154],
       [0.40013398741324346, 0.5233978679450724, 0.17939225580257578,
        0.0805187352504726, 0.535036823632897],
       [0.33929107961208027, 0.7912298410272152, 0.739854838641101,
        0.3827691194761492, 0.21373293603379018],
       [0.1304435028833364, 0.12317736228868592, 0.7976200016274823,
        0.36522821414172124, 0.17416659325445782],
       [0.6455072357542692, 0.7833317697934767, 0.35415578318557384,
        0.6142197709235105, 0.4753988381320303],
       [0.1240672672526838, 0.4079998559346837, 0.500949644585149,
        0.35106555697768493, 0.040629964813661545],
       [0.43800248628318983, 0.8992563130497335, 0.37832594709680445,
        0.22733270551836893, 0.24567750950901368]], dtype=object)

In [35]:
df2.T

,0,1,2,3,4,5,6,7,8,9
0,Shraddha,0.888598,0.802629,0.752744,0.400134,0.339291,0.130444,0.645507,0.124067,0.438002
1,0.829013,0.905147,0.718475,0.62388,0.523398,0.79123,0.123177,0.783332,0.408,0.899256
2,0.49839,0.569863,0.990198,0.116107,0.179392,0.739855,0.79762,0.354156,0.50095,0.378326
3,0.029532,0.09227,0.654161,0.078873,0.080519,0.382769,0.365228,0.61422,0.351066,0.227333
4,0.762452,0.476578,0.529322,0.849755,0.535037,0.213733,0.174167,0.475399,0.04063,0.245678

In [36]:
df2.sort_index(axis=0, ascending=False)

          0         1         2         3         4
9  0.438002  0.899256  0.378326  0.227333  0.245678
8  0.124067  0.408000  0.500950  0.351066  0.040630
7  0.645507  0.783332  0.354156  0.614220  0.475399
6  0.130444  0.123177  0.797620  0.365228  0.174167
5  0.339291  0.791230  0.739855  0.382769  0.213733
4  0.400134  0.523398  0.179392  0.080519  0.535037
3  0.752744  0.623880  0.116107  0.078873  0.849755
2  0.802629  0.718475  0.990198  0.654161  0.529322
1  0.888598  0.905147  0.569863  0.092270  0.476578
0  Shraddha  0.829013  0.498390  0.029532  0.762452

In [37]:
df2.sort_index(axis=1, ascending=False)

          4         3         2         1         0
0  0.762452  0.029532  0.498390  0.829013  Shraddha
1  0.476578  0.092270  0.569863  0.905147  0.888598
2  0.529322  0.654161  0.990198  0.718475  0.802629
3  0.849755  0.078873  0.116107  0.623880  0.752744
4  0.535037  0.080519  0.179392  0.523398  0.400134
5  0.213733  0.382769  0.739855  0.791230  0.339291
6  0.174167  0.365228  0.797620  0.123177  0.130444
7  0.475399  0.614220  0.354156  0.783332  0.645507
8  0.040630  0.351066  0.500950  0.408000  0.124067
9  0.245678  0.227333  0.378326  0.899256  0.438002

In [39]:
df2[0]

0    Shraddha
1    0.888598
2    0.802629
3    0.752744
4    0.400134
5    0.339291
6    0.130444
7    0.645507
8    0.124067
9    0.438002
Name: 0, dtype: object

In [40]:
type(df2[0])

pandas.core.series.Series

In [41]:
df2 = df

In [42]:
df2[0][0] = 50

KeyError: 0

In [43]:
df2

       name  marks        city
0  Shraddha     99    Varanasi
1     Kajal     92  Maharastra
2   Skilllf     91   Antartica
3    Pandas     90        KIET

In [44]:
df2 = df.copy()

In [45]:
df2

       name  marks        city
0  Shraddha     99    Varanasi
1     Kajal     92  Maharastra
2   Skilllf     91   Antartica
3    Pandas     90        KIET

In [46]:
df

       name  marks        city
0  Shraddha     99    Varanasi
1     Kajal     92  Maharastra
2   Skilllf     91   Antartica
3    Pandas     90        KIET

In [47]:
df2.loc[0,0] = "shraddha_here"

In [49]:
df2

       name  marks        city              0
0  Shraddha     99    Varanasi  shraddha_here
1     Kajal     92  Maharastra            NaN
2   Skilllf     91   Antartica            NaN
3    Pandas     90        KIET            NaN

In [50]:
df2.drop(0,axis=1)

       name  marks        city
0  Shraddha     99    Varanasi
1     Kajal     92  Maharastra
2   Skilllf     91   Antartica
3    Pandas     90        KIET

In [52]:
df2.loc[[1,2], ["marks","city"]]

   marks        city
1     92  Maharastra
2     91   Antartica

In [53]:
df2

       name  marks        city              0
0  Shraddha     99    Varanasi  shraddha_here
1     Kajal     92  Maharastra            NaN
2   Skilllf     91   Antartica            NaN
3    Pandas     90        KIET            NaN

In [55]:
df2.loc[:,["marks","city"]]

   marks        city
0     99    Varanasi
1     92  Maharastra
2     91   Antartica
3     90        KIET

In [57]:
df2.loc[[1,2],:]

      name  marks        city    0
1    Kajal     92  Maharastra  NaN
2  Skilllf     91   Antartica  NaN

In [3]:
df.iloc[0, 4]

NameError: name 'df' is not defined

In [6]:
import numpy as np
import pandas as pd

In [7]:
dict2 = {
    "name":["Shraddha", "Kajal", "Taylor", "Swift"],
    "marks":[97, 98, 76, 100],
    "skills":["Java","Python","Singing","Dancing"]
}

In [8]:
newdf = pd.DataFrame(dict2)

In [9]:
print(newdf)

       name  marks   skills
0  Shraddha     97     Java
1     Kajal     98   Python
2    Taylor     76  Singing
3     Swift    100  Dancing

In [11]:
newdf.iloc[0, 2]

'Java'

In [12]:
newdf.iloc[[0,1],[1,2]]

   marks  skills
0     97    Java
1     98  Python

In [13]:
newdf["skills"].isnull()

0    False
1    False
2    False
3    False
Name: skills, dtype: bool

In [14]:
newdf["skills"] = None

In [15]:
newdf

       name  marks skills
0  Shraddha     97   None
1     Kajal     98   None
2    Taylor     76   None
3     Swift    100   None

In [16]:
newdf.loc[:,["skills"]] = "Pandas"

In [17]:
newdf

       name  marks  skills
0  Shraddha     97  Pandas
1     Kajal     98  Pandas
2    Taylor     76  Pandas
3     Swift    100  Pandas

In [23]:
mydf = pd.DataFrame({"Name" : ["Shinchan", "Doraemon", "Pokemon"],
                   "%watched" : [99, 87, 93],
                   "Country" : ["Japanese", "Japanese", "Japan"]
                  })

In [24]:
mydf

       Name  %watched   Country
0  Shinchan        99  Japanese
1  Doraemon        87  Japanese
2   Pokemon        93     Japan

In [32]:
mydf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      3 non-null      object
 1   %watched  3 non-null      int64
 2   Country   3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [36]:
mydf.describe()
#mydf.mean()
#mydf.corr()
#mydf.count()
#mydf.max()
#mydf.min()
#mydf.median()
#df.std()

       %watched
count       3.0
mean       93.0
std         6.0
min        87.0
25%        90.0
50%        93.0
75%        96.0
max        99.0

In [3]:
import numpy as np
import pandas as pd

In [4]:
mydf = pd.DataFrame({"Name" : ["Shinchan", "Doraemon", "Pokemon"],
                   "%watched" : [99, 87, 93],
                   "Country" : ["Japanese", "Japanese", "Japan"]
                  })

In [5]:
mydf.to_csv("Cartoons.csv")

In [6]:
data = pd.read_excel("Aashi.xlsx",sheet_name = "Sheet1")

FileNotFoundError: [Errno 2] No such file or directory: 'Aashi.xlsx'

In [7]:
data

NameError: name 'data' is not defined

In [9]:
mydf.to_numpy()

array([['Shinchan', 99, 'Japanese'],
       ['Doraemon', 87, 'Japanese'],
       ['Pokemon', 93, 'Japan']], dtype=object)

In [13]:
mydf.sort_values(by = "%watched")

       Name  %watched   Country
1  Doraemon        87  Japanese
2   Pokemon        93     Japan
0  Shinchan        99  Japanese